app/views/post/_myposts.html.erb

SELECT "posts".* FROM "posts" INNER JOIN "authors" ON "authors"."id" = "posts"."author_id" INNER JOIN "post2tags" ON "post2tags"."post_id" = "posts"."id" WHERE "post2tags"."tag_id" = $1 ORDER BY "posts"."id" DESC  [["tag_id", "#by"]]
SELECT "post2tags".* FROM "post2tags" WHERE "post2tags"."post_id" = $1  [["post_id", 35]]
---

                        <% post.post2tags.each do |tag| %>