app/views/post/currentpost.html.erb

SELECT "post2tags".* FROM "post2tags" WHERE "post2tags"."post_id" = $1  [["post_id", 35]]
---

                      <% @post.post2tags.each do |tag| %>