app/controllers/account_controller.rb

INSERT INTO "authors" ("name", "email", "password_hash", "about", "media", "surname", "username") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def store
    default_avatar_url = "https://res.cloudinary.com/doxgbchiu/image/upload/v1587117423/78-785878_batman-icon-batman-avatar-icon-hd-png-download_xlej1p.png"
    @user = Author.new(:name => params[:name], :surname => params[:surname], :username => "@"+params[:username], :email => params[:email], :password => params[:password], :about => params[:about], :media => default_avatar_url)

    @user.save

SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def info
    @user = Author.find_by(id: params[:id])

SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "authors" SET "media" = $1 WHERE "authors"."id" = $2  [["media", "https://res.cloudinary.com/doxgbchiu/image/upload/v1587134149/kdrjtynkcfgtkokiyexy.jpg"], ["id", 6]]
---
  def updatesave
    if (session[:user_id]==nil)
      redirect_to('/login')
    end

    @userToChange = Author.find_by(id: session[:user_id])


    @userToChange.name = params[:name]== "" ? @userToChange.name : params[:name]
    @userToChange.surname = params[:surname]  == "" ? @userToChange.surname : params[:surname]
    @userToChange.password = params[:password] == "" ? @userToChange.password : params[:password]
    @userToChange.about = params[:about]  == "" ? @userToChange.about : params[:about]
    @userToChange.media = params[:media]  == nil ? @userToChange.media : Cloudinary::Uploader.upload(params[:media])['secure_url']


    @userToChange.save

SELECT "authors".* FROM "authors" WHERE "authors"."name" = $1  [["name", "Vladick"]]
SELECT "authors".* FROM "authors" WHERE "authors"."username" = $1  [["username", "@vladick1"]]
---
  def find

    if (params[:name][0].to_s != "@")
    @users = Author.where(:name => params[:name]).all
    else
      @users = Author.where(:username => params[:name]).all