app/controllers/comment_controller.rb

  def store
    if (session[:user_id]==nil)
      redirect_to('/login')
    end

    @comment = Comment.new(:body => params[:body], :dateTime => Time.now, :author_id => session[:user_id], :post_id => params[:id])
    #@user = Author.new(:name => params[:name], :email => params[:email], :password => params[:password], :about => params[:about], :media => default_avatar_url)

    @comment.save
---
INSERT INTO "comments" ("body", "dateTime", "author_id", "post_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "Tooooop "], ["dateTime", "2020-04-18 00:59:45.836318"], ["author_id", 2], ["post_id", 26]]