app/controllers/post_controller.rb

SELECT "posts".* FROM "posts" INNER JOIN "authors" ON "authors"."id" = "posts"."author_id" WHERE "posts"."author_id" = $1 ORDER BY "posts"."id" DESC  [["author_id", 6]]
---
  def myposts
    if session[:user_id] == nil
      redirect_to('/login')
    end

    @posts = Post.joins(:author).where(author_id: session[:user_id]).all.order(id: :desc)

SELECT "posts".* FROM "posts" INNER JOIN "authors" ON "authors"."id" = "posts"."author_id" WHERE "posts"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---
  def all_posts_of_selected_user
    if session[:user_id] == nil
      redirect_to('/login')
    end

    @posts = Post.joins(:author).where(author_id:  params[:id]).all.order(id: :desc)

SELECT "posts".* FROM "posts" INNER JOIN "authors" ON "authors"."id" = "posts"."author_id" INNER JOIN "post2tags" ON "post2tags"."post_id" = "posts"."id" WHERE "posts"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" INNER JOIN "authors" ON "authors"."id" = "comments"."author_id" WHERE "comments"."post_id" = $1  [["post_id", 15]]
---
  def currentpost
    @post = Post.joins(:author).joins(:post2tags).find_by(id: params[:id])
    @comments = Comment.joins(:author).where(post_id: params[:id]).all

INSERT INTO "posts" ("body", "dateTime", "author_id", "media") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "cfdfx vdfv d"], ["dateTime", "2020-04-17 18:27:08.676760"], ["author_id", 6], ["media", "https://res.cloudinary.com/doxgbchiu/image/upload/v1587148028/jidmjbocezc5sk1dmxde.jpg"]]
SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", "#hi"], ["LIMIT", 1]]
INSERT INTO "tags" ("id") VALUES ($1) RETURNING "id"  [["id", "#hi"]]
INSERT INTO "post2tags" ("tag_id", "post_id") VALUES ($1, $2)  [["tag_id", "#hi"], ["post_id", 35]]
---
  def store
    # upload image to cloudinary
    @image =  Cloudinary::Uploader.upload(params[:media])
    # create a new post object and save to db
    @post = Post.new(:body => params[:body], :dateTime => Time.now,  :author_id => session[:user_id],  :media => @image['secure_url'])

    @post.save

    tags = params[:tags].split(' ');

    if (tags != nil)
      tags.each do |tag|
        if (tag[0].to_s == "#")

          if_tag_exist =  Tag.find_by(id: tag) != nil
          if (if_tag_exist == false)
            @tag = Tag.new(:id => tag)
            @tag.save
          end

          @post_2_tag =  Post2tag.new(:tag_id => tag, :post_id => @post.id)
          @post_2_tag.save

SELECT "posts".* FROM "posts" INNER JOIN "authors" ON "authors"."id" = "posts"."author_id" INNER JOIN "post2tags" ON "post2tags"."post_id" = "posts"."id" WHERE "post2tags"."tag_id" = $1 ORDER BY "posts"."id" DESC  [["tag_id", "#by"]]
---
  def find_by_tag

    if(params[:tag].to_s != "")
      @tag = params[:tag].to_s
    else
      @tag = "#"+params[:id].to_s
    end

    @posts = Post.joins(:author).joins(:post2tags).where(post2tags: {tag_id:  @tag }).all.order(id: :desc)