app/controllers/sessions_controller.rb

SELECT "authors".* FROM "authors" WHERE "authors"."email" = $1 LIMIT $2  [["email", "string2@gmail.com"], ["LIMIT", 1]]
---
  def create
    user = Author.find_by(email: params[:email])